app/controllers/blogs_controller.rb

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "body" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3