app/controllers/site_portfolios_controller.rb

SELECT "site_portfolios".* FROM "site_portfolios"
---
	def index
		@portfolio_items = SitePortfolio.all

INSERT INTO "site_portfolios" ("title", "subtitle", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hi there"], ["subtitle", "Check it out"], ["body", "Hello World"], ["created_at", 2017-02-24 03:47:47 UTC], ["updated_at", 2017-02-24 03:47:47 UTC]]
---
	def create
	    @site_portfolio =  SitePortfolio.new(site_portfolio_params)
		    respond_to do |format|
			    if @site_portfolio.save

DELETE FROM "site_portfolios" WHERE "site_portfolios"."id" = $1  [["id", 1]]
---
	def destroy
		@portfolio_item.destroy

SELECT  "site_portfolios".* FROM "site_portfolios" WHERE "site_portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
	def set_portfolio_item
		@portfolio_item = SitePortfolio.find(params[:id])