app/views/site_portfolios/show.html.erb


<% @portfolio_item.technologies.each do |t| %>
---
SELECT "technologies".* FROM "technologies" WHERE "technologies"."site_portfolio_id" = $1  [["site_portfolio_id", 12]]